//Number.MAX_SAFE_INTEGER -- максимальное безопасное число
//Number.MIN_SAFE_INTEGER -- минимальное безопасное число

//Number.POSITIVE_INFINITY -- положительная бесконечность
//Number.NEGATIVE_INFINITY -- отрицательная бесконечность

//Number.isNaN -- проверка является ли число NaN
//Number.isFinite -- проверяет является ли число конечным (не бесконечность)

//Number.parseInt() -- возвращает целое число
//Number.parseFloat() -- возвращает число с дробями
//+string -- преобразует строку в число
// Number.toFixed(число знаков после запятой) -- обрезает ненужные значения после запятой !ВОЗВРАЩАЕТ СТРОКУ!

// BigInt не может быты дробным, все вычисления идут только с числами BigInt

//Math.E - число e
//Math.PI - число пи
//Math.sqrt(25) -- квадратный корень 25
//Math.pow(5, 3) -- возведение числа 5 в 3 степень
//Math.abs(-42) -- модуль числа
//Math.max(42, 12, 23, 11, 422) -- вернет максимальное число
//Math.min(42, 12, 23, 11, 422) -- вернет минимаьное число
//Math.floor(4.9) -- всегда округляет в меньшую сторону // вывод 4
//Math.ceil(-4.9) -- всегда округляет в большую сторону // вывод -4
//Math.round(4.5) -- округляет число к ближайшему целому // вывод 5
//Math.trunc(4.9) -- возвращает целое число путем удаление всех дробных частей
//Math.random() -- хуярит рандомные числа от 0 до 1 не включая 1

