const name = `Roma`;
//num.toString() -- переводит число в строку
// name.length -- вычисляет длинну строки
// name.toUpperCase() -- возвращает строку в верхнем регистре
// name.toLowerCase() -- возвращает строку в нижнем регистре
// name.charAt(index) -- возвращает символ из строки по указаному индексу
// name.indexOf('R') -- возвращает индекс символа в строке
// name.startsWith('Ro') -- возвращает true/false
// name.endsWith('ma') -- возвращает true/false
// name.repeat(n) -- повторить строку n-раз
// name.trim() - удаляет пробелы с 2 сторон
// name.trimLeft() -- удаляет пробелы слева
// name.trimRight() -- удаляет пробелы справа
//name.includes(`Rom`,index) -- проверяет наличие символов в строке, второе значение индекс с которого проверять

//name.split([разделитель], [максимальное количество элементов]) -- разбивает обьект string на массив
//если пустой то каждый символ выведет

//name.slice(startindex,endindex) -- получить часть строки, отрицательные индексы ищут с конца

// Получаем символы строки
// for (let keys in name){
//     console.log(name[keys]);   
// }

//replace([что меняем],[на что меняем]) -- меняет 1 найденый символ
//replaceAll([что меняем],[на что меняем]) -- меняет все символы в строке

//padStart([какой должна быть длинна строки],[символ который добавит в начало если строки меньше указаной])
//padEnd([какой должна быть длинна строки],[символ который добавит в конец если строки меньше указаной])
